app/Repositories/CategoryRepository.php

    public function getCategoryById($id)
    {
        $findCatId = Category::where('cat_id', $id)->selectRaw('IF(cat_parent_id=0,cat_id,cat_parent_id)')->first();
        if ($findCatId) {
            $categoryId = Category::whereIn('cat_id', $findCatId)->whereNotNull('cat_slug')
                ->select('cat_id', 'cat_name', 'cat_slug', 'cat_parent_id')
                ->first();
            if($categoryId) {
                $categoryChild = Category::where('cat_parent_id', $categoryId->cat_id)
                    ->where('cat_active', 1)->whereNotNull('cat_slug')
                    ->select('cat_id', 'cat_name', 'cat_slug', 'cat_parent_id', 'cat_active')
                    ->get();
---
select IF(cat_parent_id=0,cat_id,cat_parent_id) from `categories` where `cat_id` = '1' limit 1
select `cat_id`, `cat_name`, `cat_slug`, `cat_parent_id` from `categories` where `cat_id` in (1) and `cat_slug` is not null limit 1
select `cat_id`, `cat_name`, `cat_slug`, `cat_parent_id`, `cat_active` from `categories` where `cat_parent_id` = 1 and `cat_active` = 1 and `cat_slug` is not null

    public function getPostByCategory($id)
    {
        return Posts::join('categories', 'pos_cat_id', '=', 'cat_id')
            ->where('pos_cat_id', $id)->where('pos_status', 1)->whereNotNull('pos_slug')->whereNotNull('cat_slug')
            ->select('pos_id','pos_title', 'pos_slug', 'pos_image', 'pos_description', 'pos_cat_id', 'pos_status', 'pos_created_at', 'cat_id', 'cat_name', 'cat_slug')
            ->orderBy('pos_id', 'desc')
            ->paginate(10);
---
select `pos_id`, `pos_title`, `pos_slug`, `pos_image`, `pos_description`, `pos_cat_id`, `pos_status`, `pos_created_at`, `cat_id`, `cat_name`, `cat_slug` from `posts` inner join `categories` on `pos_cat_id` = `cat_id` where `pos_cat_id` = '1' and `pos_status` = 1 and `pos_slug` is not null and `cat_slug` is not null order by `pos_id` desc limit 10 offset 0
select count(*) as aggregate from `posts` inner join `categories` on `pos_cat_id` = `cat_id` where `pos_cat_id` = '1' and `pos_status` = 1 and `pos_slug` is not null and `cat_slug` is not null