app/Repositories/HomeRepository.php

select `cat_id`, `cat_name`, `cat_slug`, `cat_parent_id`, `cat_active` from `categories` where `cat_parent_id` = 0 and `cat_active` = 1 and `cat_slug` is not null
select `cat_id`, `cat_name`, `cat_slug`, `cat_parent_id`, `cat_active` from `categories` where `cat_parent_id` = 1 and `cat_active` = 1 and `cat_slug` is not null
---
    public function getCategories()
    {
        $categories = Category::where('cat_parent_id', 0)
            ->where('cat_active', 1)->whereNotNull('cat_slug')
            ->select('cat_id', 'cat_name', 'cat_slug', 'cat_parent_id', 'cat_active')
            ->get();
        foreach ($categories as $value) {
            $categoriesChild = Category::where('cat_parent_id', $value->cat_id)
                ->where('cat_active', 1)->whereNotNull('cat_slug')
                ->select('cat_id', 'cat_name', 'cat_slug', 'cat_parent_id', 'cat_active')
                ->get();

select * from `banners` where `ban_active` = 1 order by `ban_id` desc limit 3
---
    public function getBanner()
    {
        return Banner::where('ban_active', 1)
            ->orderBy('ban_id', 'desc')
            ->limit(3)
            ->get();

select `pos_id`, `pos_title`, `pos_slug`, `pos_description`, `pos_image`, `pos_cat_id`, `pos_status`, `pos_rating`, `pos_view`, `pos_created_at`, `cat_id`, `cat_name`, `cat_slug` from `posts` inner join `categories` on `pos_cat_id` = `cat_id` where `pos_status` = 1 and `pos_slug` is not null and `cat_slug` is not null order by `pos_id` desc limit 5
---
    public function getPosts()
    {
        return Posts::join('categories', 'pos_cat_id', '=', 'cat_id')
            ->where('pos_status', 1)->whereNotNull('pos_slug')->whereNotNull('cat_slug')
            ->select('pos_id','pos_title', 'pos_slug', 'pos_description', 'pos_image', 'pos_cat_id', 'pos_status', 'pos_rating', 'pos_view', 'pos_created_at', 'cat_id', 'cat_name', 'cat_slug')
            ->orderBy('pos_id', 'desc')
            ->limit(5)
            ->get();

select `pos_id`, `pos_title`, `pos_slug`, `pos_image`, `pos_description`, `pos_status`, `pos_hot`, `pos_created_at` from `posts` where `pos_hot` = 1 and `pos_status` = 1 and `pos_slug` is not null order by `pos_id` desc limit 1
select `pos_id`, `pos_title`, `pos_slug`, `pos_image`, `pos_description`, `pos_status`, `pos_hot`, `pos_created_at` from `posts` where `pos_id` < 724 and `pos_hot` = 1 and `pos_status` = 1 and `pos_slug` is not null order by `pos_id` desc limit 1
select `pos_id`, `pos_title`, `pos_slug`, `pos_image`, `pos_description`, `pos_status`, `pos_hot`, `pos_created_at` from `posts` where `pos_id` < 716 and `pos_hot` = 1 and `pos_status` = 1 and `pos_slug` is not null order by `pos_id` desc limit 1
---
    public function getPostsHot()
    {
        $postsHot = Posts::where('pos_hot', 1)
            ->where('pos_status', 1)->whereNotNull('pos_slug')
            ->select('pos_id','pos_title', 'pos_slug', 'pos_image', 'pos_description', 'pos_status', 'pos_hot', 'pos_created_at')
            ->orderBy('pos_id', 'desc')
            ->first();
        if($postsHot) {
            $postsHotSmall = Posts:: where('pos_id', '<', $postsHot->pos_id)
                ->where('pos_hot', 1)->where('pos_status', 1)->whereNotNull('pos_slug')
                ->select('pos_id','pos_title', 'pos_slug', 'pos_image', 'pos_description', 'pos_status', 'pos_hot', 'pos_created_at')
                ->orderBy('pos_id', 'desc')
                ->first();
            $postsHot->hotSmall = $postsHotSmall;
            if($postsHotSmall) {
                $postsHotSmaller = Posts:: where('pos_id', '<', $postsHotSmall->pos_id)
                    ->where('pos_hot', 1)->where('pos_status', 1)->whereNotNull('pos_slug')
                    ->select('pos_id','pos_title', 'pos_slug', 'pos_image', 'pos_description', 'pos_status', 'pos_hot', 'pos_created_at')
                    ->orderBy('pos_id', 'desc')
                    ->first();

select `pos_id`, `pos_title`, `pos_slug`, `pos_image`, `pos_description`, `pos_cat_id`, `pos_status`, `pos_rating`, `pos_view`, `pos_created_at`, `cat_id`, `cat_name`, `cat_slug` from `posts` inner join `categories` on `pos_cat_id` = `cat_id` where `pos_hot` = 1 and `pos_status` = 1 and `pos_slug` is not null and `cat_slug` is not null order by `pos_id` desc limit 5
---
    public function getPostsHotList()
    {
        return Posts::join('categories', 'pos_cat_id', '=', 'cat_id')
            ->where('pos_hot', 1)->where('pos_status', 1)->whereNotNull('pos_slug')->whereNotNull('cat_slug')
            ->select('pos_id','pos_title', 'pos_slug', 'pos_image', 'pos_description', 'pos_cat_id', 'pos_status', 'pos_rating', 'pos_view', 'pos_created_at', 'cat_id', 'cat_name', 'cat_slug')
            ->orderBy('pos_id', 'desc')
            ->limit(5)
            ->get();

select `cat_id`, `cat_name` from `categories` inner join `posts` on `pos_cat_id` = `cat_id` where `cat_hot` = 1 and `cat_active` = 1 order by `cat_id` desc limit 1
select `pos_id`, `pos_title`, `pos_slug`, `pos_image` from `posts` where `pos_cat_id` = 12 and `pos_status` = 1 and `pos_slug` is not null order by `pos_id` desc limit 4
select `cat_id`, `cat_name` from `categories` inner join `posts` on `pos_cat_id` = `cat_id` where `cat_id` < 12 and `cat_active` = 1 order by `cat_id` desc limit 1
select `pos_id`, `pos_title`, `pos_slug`, `pos_image` from `posts` where `pos_cat_id` = 11 and `pos_status` = 1 and `pos_slug` is not null order by `pos_id` desc limit 2
select `cat_id`, `cat_name` from `categories` inner join `posts` on `pos_cat_id` = `cat_id` where `cat_id` < 11 and `cat_hot` = 1 and `cat_active` = 1 order by `cat_id` desc limit 1
select `pos_id`, `pos_title`, `pos_slug`, `pos_image` from `posts` where `pos_cat_id` = 1 and `pos_status` = 1 and `pos_slug` is not null order by `pos_id` desc limit 3
---
    public function getCategoriesHot() {
        $categoriesHot = Category::join('posts', 'pos_cat_id', '=', 'cat_id')
            ->where('cat_hot', 1)->where('cat_active', 1)
            ->select('cat_id', 'cat_name')
            ->orderBy('cat_id', 'desc')
            ->first();
        if ($categoriesHot) {
            $categoriesHotPosts = Posts::where('pos_cat_id', $categoriesHot->cat_id)
                ->where('pos_status', 1)->whereNotNull('pos_slug')
                ->select('pos_id', 'pos_title', 'pos_slug', 'pos_image')
                ->orderBy('pos_id', 'desc')
                ->limit(4)
                ->get();
            $categoriesHot->posts = $categoriesHotPosts;

            $categoriesHot2 = Category::join('posts', 'pos_cat_id', '=', 'cat_id')
                ->where('cat_id', '<', $categoriesHot->cat_id)
                // ->where('cat_hot', 1)
                ->where('cat_active', 1)
                ->select('cat_id', 'cat_name')
                ->orderBy('cat_id', 'desc')
                ->first();

            if($categoriesHot2) {
                $categoriesHotPosts2 = Posts::where('pos_cat_id', $categoriesHot2->cat_id)
                    ->where('pos_status', 1)->whereNotNull('pos_slug')
                    ->select('pos_id', 'pos_title', 'pos_slug', 'pos_image')
                    ->orderBy('pos_id', 'desc')
                    ->limit(2)
                    ->get();
                $categoriesHot2->posts = $categoriesHotPosts2;
                $categoriesHot->hot2 = $categoriesHot2;

                $categoriesHot3 = Category::join('posts', 'pos_cat_id', '=', 'cat_id')
                    ->where('cat_id', '<', $categoriesHot2->cat_id)->where('cat_hot', 1)->where('cat_active', 1)
                    ->select('cat_id', 'cat_name')
                    ->orderBy('cat_id', 'desc')
                    ->first();
                if($categoriesHot3) {
                    $categoriesHotPosts3 = Posts::where('pos_cat_id', $categoriesHot3->cat_id)
                        ->where('pos_status', 1)->whereNotNull('pos_slug')
                        ->select('pos_id', 'pos_title', 'pos_slug', 'pos_image')
                        ->orderBy('pos_id', 'desc')
                        ->limit(3)
                        ->get();

select `pos_id`, `pos_title`, `pos_slug`, `pos_image`, `pos_description`, `pos_cat_id`, `pos_status`, `pos_rating`, `pos_view`, `pos_created_at`, `cat_id`, `cat_name`, `cat_slug` from `posts` inner join `categories` on `pos_cat_id` = `cat_id` where `pos_status` = 1 and `pos_slug` is not null and `cat_slug` is not null order by `pos_rating` desc limit 5
---
    public function getPostRating()
    {
        return Posts::join('categories', 'pos_cat_id', '=', 'cat_id')
            ->where('pos_status', 1)->whereNotNull('pos_slug')->whereNotNull('cat_slug')
            ->select('pos_id','pos_title', 'pos_slug', 'pos_image', 'pos_description', 'pos_cat_id', 'pos_status', 'pos_rating', 'pos_view', 'pos_created_at', 'cat_id', 'cat_name', 'cat_slug')
            ->orderBy('pos_rating', 'desc')
            ->limit(5)
            ->get();

select `pos_id`, `pos_title`, `pos_slug`, `pos_image`, `pos_description`, `pos_cat_id`, `pos_status`, `pos_rating`, `pos_view`, `pos_created_at`, `cat_id`, `cat_name`, `cat_slug` from `posts` inner join `categories` on `pos_cat_id` = `cat_id` where `pos_status` = 1 and `pos_slug` is not null and `cat_slug` is not null order by `pos_view` desc limit 5
---
    public function getPostView()
    {
        return Posts::join('categories', 'pos_cat_id', '=', 'cat_id')
            ->where('pos_status', 1)->whereNotNull('pos_slug')->whereNotNull('cat_slug')
            ->select('pos_id','pos_title', 'pos_slug', 'pos_image', 'pos_description', 'pos_cat_id', 'pos_status', 'pos_rating', 'pos_view', 'pos_created_at', 'cat_id', 'cat_name', 'cat_slug')
            ->orderBy('pos_view', 'desc')
            ->limit(5)
            ->get();

select `con_id`, `con_admin_email`, `con_site_title`, `con_meta_description`, `con_meta_keywords`, `con_hotline`, `con_address`, `con_youtube`, `con_twitter`, `con_google_plus`, `con_facebook`, `con_word_text`, `con_total_restaurant` from `configuration` order by `con_id` asc limit 1
---
    public function getConfiguration()
    {
        return Configuration::select('con_id', 'con_admin_email', 'con_site_title', 'con_meta_description', 'con_meta_keywords', 'con_hotline', 'con_address', 'con_youtube', 'con_twitter', 'con_google_plus', 'con_facebook', 'con_word_text', 'con_total_restaurant')
            ->orderBy('con_id','asc')->first();