app/Repositories/PostRepository.php

select `pos_id`, `pos_title`, `pos_slug`, `pos_image`, `pos_description`, `pos_content`, `pos_status`, `pos_website`, `pos_rating`, `pos_created_at`, `pos_updated_at`, `pos_cat_id`, `cat_id`, `cat_name`, `cat_slug`, `adm_id`, `adm_name`, `adm_loginname` from `posts` inner join `categories` on `pos_cat_id` = `cat_id` left join `admin` on `pos_admin_id` = `adm_id` where `pos_id` = '716' limit 1
---
    public function getPostById($id)
    {

        return Posts::leftJoin('categories', 'pos_cat_id', '=', 'cat_id')
            ->leftJoin('admin', 'pos_admin_id', '=', 'adm_id')
            ->where('pos_id', $id)
            ->select('pos_id', 'pos_title', 'pos_slug', 'pos_image', 'pos_description', 'pos_content', 'pos_status', 'pos_website', 'pos_rating', 'pos_created_at', 'pos_updated_at', 'pos_cat_id', 'cat_id', 'cat_name', 'cat_slug', 'adm_id', 'adm_name', 'adm_loginname')
            ->first();

select `pota_post_id`, `tag_id`, `tag_name`, `tag_slug`, `tag_active` from `post_tags` inner join `tags` on `pota_tag_id` = `tag_id` where `pota_post_id` = '716' and `tag_active` = 1 and `tag_slug` is not null
---
    public function getPostTags($id)
    {
        return PostTag::join('tags', 'pota_tag_id', '=', 'tag_id')
            ->where('pota_post_id', $id)->where('tag_active', 1)
            ->select('pota_post_id', 'tag_id', 'tag_name', 'tag_slug', 'tag_active')
            ->get();

select `pos_id`, `pos_cat_id` from `posts` where `pos_id` = '716' limit 1
select `pos_id`, `pos_title`, `pos_slug`, `pos_image`, `pos_hot`, `pos_created_at` from `posts` where `pos_cat_id` = 3 and `pos_id` <> '716' and `pos_hot` = 1 and `pos_slug` is not null order by `pos_id` desc limit 3
---
    public function getPostRelateHot($id)
    {
        $postDetail = Posts::where('pos_id', $id)
            ->select('pos_id', 'pos_cat_id')
            ->first();
        if($postDetail)
            return Posts::where('pos_cat_id', $postDetail->pos_cat_id)
                ->where('pos_id', '<>', $id)->where('pos_hot', 1)
                ->select('pos_id', 'pos_title', 'pos_slug', 'pos_image', 'pos_hot', 'pos_created_at')
                ->orderBy('pos_id', 'desc')
                ->limit(3)
                ->get();

select `pos_id`, `pos_cat_id` from `posts` where `pos_id` = '716' limit 1
select `pos_id`, `pos_title`, `pos_slug`, `pos_image`, `pos_hot`, `pos_created_at` from `posts` where `pos_cat_id` = 3 and `pos_id` <> '716' and `pos_hot` = 0 and `pos_slug` is not null order by `pos_id` desc limit 3
---
    public function getPostRelate($id)
    {
        $postDetail = Posts::where('pos_id', $id)
            ->select('pos_id', 'pos_cat_id')
            ->first();
        if($postDetail)
            return Posts::where('pos_cat_id', $postDetail->pos_cat_id)
                ->where('pos_id', '<>', $id)->where('pos_hot', 0)
                ->select('pos_id', 'pos_title', 'pos_slug', 'pos_image', 'pos_hot', 'pos_created_at')
                ->orderBy('pos_id', 'desc')
                ->limit(3)
                ->get();