app/Repositories/SearchRepository.php

    public function searchPosts($name) {
        return Posts::join('categories', 'pos_cat_id', '=', 'cat_id')
            ->where('pos_title', 'LIKE', '%' . $name . '%')->where('pos_status', 1)
            ->whereNotNull('pos_slug')->whereNotNull('cat_slug')
            ->select('pos_id','pos_title', 'pos_slug', 'pos_image', 'pos_description', 'pos_cat_id', 'pos_status', 'pos_created_at', 'cat_id', 'cat_name', 'cat_slug')
            ->orderBy('pos_id', 'desc')
            ->paginate(10);
---
select `pos_id`, `pos_title`, `pos_slug`, `pos_image`, `pos_description`, `pos_cat_id`, `pos_status`, `pos_created_at`, `cat_id`, `cat_name`, `cat_slug` from `posts` inner join `categories` on `pos_cat_id` = `cat_id` where `pos_title` LIKE '%hà nội%' and `pos_status` = 1 and `pos_slug` is not null and `cat_slug` is not null order by `pos_id` desc limit 10 offset 0
select count(*) as aggregate from `posts` inner join `categories` on `pos_cat_id` = `cat_id` where `pos_title` LIKE '%hà nội%' and `pos_status` = 1 and `pos_slug` is not null and `cat_slug` is not null